README.org
:PROPERTIES:
:ID:       cfd74497-ade8-4704-b9fa-a29414a38458
:END:
#+title: README
#+filetags: :python:ai:project:university:
#+date: [2024-06-06 Thu 19:59]
* Reference
- ISDT: https://github.com/UniversalDependencies/UD_Italian-ISDT
  + used commit =5bb0bf3=
- https://gist.github.com/syllog1sm/10343947
* Running
#+begin_example
usage: parser.py [-h] [--test heldout golden] [--train training n_iterations]
                 [-q sentence]

A compact dependency parser. Uses .conll for data.

options:
  -h, --help            show this help message and exit
  --test heldout golden
                        Test the parser, args are heldout pos and test data
                        .conll
  --train training n_iterations
                        Train the parser, args are training data .conll and
                        number of iterations
  -q sentence, --query sentence
                        Parse dependency for query
#+end_example

In general use with:
#+begin_src bash
python parser.py --train wsj_train.dep
python parser.py --test wsj_train.pos wsj_test.dep
python parser.py --query 'test sentence'
#+end_src

* Test
To test you can run:
#+begin_src bash
python parser.py -h
python parser.py --train data/it_isdt-ud-train.conll 15
python parser.py --test data/heldout.pos data/it_isdt-ud-test.conll
python parser.py -q 'essere guerra con il nemico " .'
#+end_src

* Getting the data
Obtain ~wsj_train.dep~ [fn:1]:
#+begin_src bash
for f in $1/*.mrg; do
    echo $f
    grep -v CODE $f > "$f.2"
    out="$f.dep"
    java -mx800m -cp "$scriptdir/*:" edu.stanford.nlp.trees.EnglishGrammaticalStructure \
-treeFile "$f.2" -basic -makeCopulaHead -conllx > $out
done
#+end_src

Convert to ~conll-x~ format[fn:2]:
#+begin_src bash
perl conllu_to_conllx.pl < file.conllu > file.conll
#+end_src

Extract word/tag tuples for the test sentences:
#+begin_src bash
../tools/extract-pos it_isdt-ud-test.conllu
#+end_src

[fn:1] https://explosion.ai/blog/parsing-english-in-python
[fn:2] https://github.com/UniversalDependencies/tools
